app/views/user_skill_assignments/_form.html.erb

    <%= f.label :user_id %><br>
	<%= f.collection_select(:user_id, User.all, :id, :email, {prompt: "Select Email"}, {class: "form-control"}) %>
---
SELECT "users".* FROM "users"

    <%= f.label :skill_id %><br>
	<%= f.collection_select(:skill_id, Skill.all, :id, :name, {prompt: "Select Skill"}, {class: "form-control"}) %>
---
SELECT "skills".* FROM "skills"

    <%= f.label :level_id %><br>
	<%= f.collection_select(:level_id, SkillLevel.all, :id, :level, {prompt: "Select Level"}, {class: "form-control"}) %>
---
SELECT "skill_levels".* FROM "skill_levels"