app/views/user_skill_assignments/index.html.erb

		@user_skill_assignments.each do |user_skill_assignment|
			@user=User.where(:id => user_skill_assignment.user_id).first
			@skill=Skill.where(:id => user_skill_assignment.skill_id).first
			@level=SkillLevel.where(:id => user_skill_assignment.level_id).first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1  ORDER BY "skills"."id" ASC LIMIT 1  [["id", 2]]
SELECT  "skill_levels".* FROM "skill_levels" WHERE "skill_levels"."id" = $1  ORDER BY "skill_levels"."id" ASC LIMIT 1  [["id", 2]]