app/controllers/endorsements_controller.rb

  def index
    @endorsements = Endorsement.all
---
SELECT "endorsements".* FROM "endorsements"