app/controllers/prerequisites_controller.rb

  def index
    @prerequisites = Prerequisite.all
---
SELECT "prerequisites".* FROM "prerequisites"