app/controllers/skill_levels_controller.rb

  def index
    @skill_levels = SkillLevel.all
---
SELECT "skill_levels".* FROM "skill_levels"

    def set_skill_level
      @skill_level = SkillLevel.find(params[:id])
---
SELECT  "skill_levels".* FROM "skill_levels" WHERE "skill_levels"."id" = $1 LIMIT 1  [["id", 1]]