app/controllers/skills_controller.rb

INSERT INTO "skills" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Name"], ["created_at", "2016-03-08 07:45:01.817582"], ["updated_at", "2016-03-08 07:45:01.817582"]]
---
  def create
    @skill = Skill.new(skill_params)

    respond_to do |format|
      if @skill.save

UPDATE "skills" SET "name" = $1, "updated_at" = $2 WHERE "skills"."id" = $3  [["name", "Trep"], ["updated_at", "2016-03-08 07:52:55.884580"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @skill.update(skill_params)

DELETE FROM "skills" WHERE "skills"."id" = $1  [["id", 1]]
---
  def destroy
    @skill.destroy