app/controllers/user_skill_assignments_controller.rb

  def index
    @user_skill_assignments = UserSkillAssignment.all
---
SELECT "user_skill_assignments".* FROM "user_skill_assignments"

  def create
    @user_skill_assignment = UserSkillAssignment.new(user_skill_assignment_params)

    respond_to do |format|
      if @user_skill_assignment.save
---
INSERT INTO "user_skill_assignments" ("user_id", "skill_id", "level_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["skill_id", 2], ["level_id", 2], ["created_at", "2016-03-24 15:43:58.601326"], ["updated_at", "2016-03-24 15:43:58.601326"]]

  def destroy
    @user_skill_assignment.destroy
---
DELETE FROM "user_skill_assignments" WHERE "user_skill_assignments"."id" = $1  [["id", 1]]

    def set_user_skill_assignment
      @user_skill_assignment = UserSkillAssignment.find(params[:id])
---
SELECT  "user_skill_assignments".* FROM "user_skill_assignments" WHERE "user_skill_assignments"."id" = $1 LIMIT 1  [["id", 1]]