app/views/materials/_form.html.erb

	<%= f.label :level_id %><br>
	<%= f.collection_select(:level_id, SkillLevel.all, :id, :level, {prompt: "Select level"}, {class: "form-control"}) %>
---
SELECT "skill_levels".* FROM "skill_levels"